public class Main {
    public static void main(String[] args) {
// Задание 1
    int clientOs = 1;
    if (clientOs == 0) {
        System.out.println("Установите версию приложения для IOS по ссылке");
    } else if (clientOs == 1) {
        System.out.println("Установите версию приложения для Android по ссылке");
    } else {
        System.out.println("Под такую ОС нет приложения");
    }}}